#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
googleplay_user.example: Refreshing state... [name=developers/5166846112789481453/users/example@oliverbinns.info]
googleplay_user.oliver: Refreshing state... [name=developers/5166846112789481453/users/mail@oliverbinns.info]
googleplay_user.service_account: Refreshing state... [name=developers/5166846112789481453/users/google-play-console@seraphic-elixir-305011.iam.gserviceaccount.com]
github_repository.public["Versioning"]: Refreshing state... [id=Versioning]
github_repository.public["app-attest"]: Refreshing state... [id=app-attest]
github_repository.public["personal-infra"]: Refreshing state... [id=personal-infra]
github_repository.public["appstore-go"]: Refreshing state... [id=appstore-go]
github_repository.public["Capture"]: Refreshing state... [id=Capture]
github_repository.public["Website"]: Refreshing state... [id=Website]
github_repository.public["Conferences"]: Refreshing state... [id=Conferences]
github_repository.public["googleplay-go"]: Refreshing state... [id=googleplay-go]
github_repository.public["terraform-provider-googleplay"]: Refreshing state... [id=terraform-provider-googleplay]
github_repository.public["Cards"]: Refreshing state... [id=Cards]
github_repository.public["Crescendo"]: Refreshing state... [id=Crescendo]
github_repository.public["Choose"]: Refreshing state... [id=Choose]
github_branch_protection.public["Choose"]: Refreshing state... [id=BPR_kwDOMJ5lf84DxYAM]
github_branch_protection.public["Crescendo"]: Refreshing state... [id=BPR_kwDOK-nfKM4Dk1MS]
github_branch_protection.public["Cards"]: Refreshing state... [id=BPR_kwDOGuN9tM4CTsSe]
github_branch_protection.public["personal-infra"]: Refreshing state... [id=BPR_kwDOOepWKs4DxXSv]
github_branch_protection.public["Versioning"]: Refreshing state... [id=BPR_kwDOKqGNBc4CmKn9]
github_branch_protection.public["appstore-go"]: Refreshing state... [id=BPR_kwDOO2LLnM4Dyyfx]
github_branch_protection.public["googleplay-go"]: Refreshing state... [id=BPR_kwDOOGYaGs4DnFfB]
github_branch_protection.public["Capture"]: Refreshing state... [id=BPR_kwDOLQV1yM4Cyc3H]
github_branch_protection.public["Website"]: Refreshing state... [id=BPR_kwDOJFY4-M4CHjvY]
github_branch_protection.public["terraform-provider-googleplay"]: Refreshing state... [id=BPR_kwDOODHYWs4DmTep]
github_branch_protection.public["app-attest"]: Refreshing state... [id=BPR_kwDONDwFa84DxYEC]
github_branch_protection.public["Conferences"]: Refreshing state... [id=BPR_kwDOIuMSZM4B9Yni]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_branch_protection.public["terraform-provider-appstore"] will be created
  + resource "github_branch_protection" "public" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 0
        }

      + required_status_checks {
          + contexts = [
              + "Build",
              + "Terraform Provider Acceptance Tests (1.0.*)",
              + "Terraform Provider Acceptance Tests (1.1.*)",
              + "Terraform Provider Acceptance Tests (1.2.*)",
              + "Terraform Provider Acceptance Tests (1.3.*)",
              + "Terraform Provider Acceptance Tests (1.4.*)",
              + "Validate Pull Request",
              + "generate",
            ]
          + strict   = false
        }
    }

  # github_repository.public["terraform-provider-appstore"] will be created
  + resource "github_repository" "public" {
      + allow_auto_merge            = false
      + allow_merge_commit          = false
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + archive_on_destroy          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Terraform provider for managing resources in Apple Developer portal / App Store Connect."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = false
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + license_template            = "mit"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "terraform-provider-appstore"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)

      + template {
          + include_all_branches = false
          + owner                = "hashicorp"
          + repository           = "terraform-provider-scaffolding-framework"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Oliver-Binns, Action: `pull_request`, Working Directory: ``, Workflow: `Plan Infrastructure Updates`*